jwt_auth/src/InformationRegisters/ПерсональныеТокеныДоступа/ПерсональныеТокеныДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПерсональныеТокеныДоступа</name>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ХэшHex</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СольHex</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Алгоритм</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДействуетДо</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Отозван</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоследнееИспользование</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Создан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторТокена</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

jwt_auth/src/InformationRegisters/ПерсональныеТокеныДоступа/ManagerModule.bsl
Процедура Записать(Знач Данные) Экспорт
	
	Менеджер = СоздатьМенеджерЗаписи();
	
	Менеджер.ИдентификаторТокена = Данные.ИдентификаторТокена;
	Менеджер.Пользователь = Данные.Пользователь;
	
	Менеджер.ХэшHex = Данные.ХэшHex;
	Менеджер.СольHex = Данные.СольHex;
	Менеджер.Алгоритм = Данные.Алгоритм;
	
	Менеджер.ДействуетДо = Данные.ДействуетДо;
	Менеджер.Отозван = Данные.Отозван;
	Менеджер.Создан = Данные.Создан;
	Менеджер.ПоследнееИспользование = Данные.ПоследнееИспользование;
	Менеджер.Описание = Данные.Описание;
	
	Менеджер.Записать();
КонецПроцедуры

Функция ПрочитатьПоИдентификатору(Знач ИдентификаторТокена) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	T.ИдентификаторТокена КАК ИдентификаторТокена,
	|	T.Пользователь КАК Пользователь,
	|	T.ХэшHex КАК ХэшHex,
	|	T.СольHex КАК СольHex,
	|	T.Алгоритм КАК Алгоритм,
	|	T.ДействуетДо КАК ДействуетДо,
	|	T.Отозван КАК Отозван,
	|	T.Создан КАК Создан,
	|	T.ПоследнееИспользование КАК ПоследнееИспользование,
	|	T.Описание КАК Описание
	|ИЗ
	|	РегистрСведений.ПерсональныеТокеныДоступа КАК T
	|ГДЕ
	|	T.ИдентификаторТокена = &Id";
	
	Запрос.УстановитьПараметр("Id", ИдентификаторТокена);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Данные = Новый Структура;
	Данные.Вставить("ИдентификаторТокена", Выборка.ИдентификаторТокена);
	Данные.Вставить("Пользователь", Выборка.Пользователь);
	Данные.Вставить("ХэшHex", Выборка.ХэшHex);
	Данные.Вставить("СольHex", Выборка.СольHex);
	Данные.Вставить("Алгоритм", Выборка.Алгоритм);
	Данные.Вставить("ДействуетДо", Выборка.ДействуетДо);
	Данные.Вставить("Отозван", Выборка.Отозван);
	Данные.Вставить("Создан", Выборка.Создан);
	Данные.Вставить("ПоследнееИспользование", Выборка.ПоследнееИспользование);
	Данные.Вставить("Описание", Выборка.Описание);
	
	Возврат Данные;
КонецФункции

Процедура ОбновитьПоследнееИспользование(Знач ИдентификаторТокена, Знач ВремяUTC) Экспорт
	Менеджер = СоздатьМенеджерЗаписи();
	Менеджер.ИдентификаторТокена = ИдентификаторТокена;
	
	Менеджер.Прочитать();
	Если НЕ Менеджер.Выбран() Тогда
		ВызватьИсключение "Запись не найдена";
	КонецЕсли;
	
	Менеджер.ПоследнееИспользование = ВремяUTC;
	
	Менеджер.Записать();
	
КонецПроцедуры

Процедура Отозвать(Знач ИдентификаторТокена) Экспорт
	Менеджер = СоздатьМенеджерЗаписи();
	Менеджер.ИдентификаторТокена = ИдентификаторТокена;
	
	Если НЕ Менеджер.Прочитать() Тогда
		Возврат;
	КонецЕсли;
	
	Менеджер.Отозван = Истина;
	Менеджер.Записать();
КонецПроцедуры
